Proekr_Konf/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Proekr_Konf/src/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Module.bsl
// Описание пользователя.
// 
// Возвращаемое значение:
//  Структура - Описание пользователя:
// * Имя - Строка - 
// * ДатаРождения - Дата - 
// * Штатный - Булево - 
// * Стаж - Число - 
&НаКлиенте
Функция ОписаниеПользователя()
	
	Человек = Новый Структура;
	Человек.Вставить("Имя", "Антон");
	Человек.Вставить("ДатаРождения", ТекущаяДата());
	Человек.Вставить("Штатный", Истина);
	Человек.Вставить("Стаж", 10);
	
	Возврат Человек
КонецФункции	

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ТекстСообщения = "Изменилось количество";
	
	ПересчитатьСумму(ТекДанные, ТекстСообщения);
	

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ТекстСообщения = "Изменилась цена";
	
	ПересчитатьСумму(ТекДанные, ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму(СтрокаТовары, Знач СообщениеПользователю) Экспорт
	СтрокаТовары.Сумма = СтрокаТовары.Количество * СтрокаТовары.Цена;
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (СообщениеПользователю);
	Сообщение.Сообщить();

	Пользователь = ОписаниеПользователя();
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (Пользователь.Имя);
	Сообщение.Сообщить();
	

КонецПроцедуры
